[
  {
    "jobTitle": "Team Lead (Remote Team)",
    "companyName": "VIRTUOS HOLDINGS PTE. LTD.",
    "salaryRange": "$5,000 $11,000",
    "jobCategory": "Entertainment",
    "jobLevel": "Manager",
    "employmentType": "Temporary, Full Time, Flexi-work",
    "postedDate": "15 Feb 2023",
    "expiryDate": "01 Mar 2023",
    "minimumExperience": "4 years exp",
    "jobDescription": "About the position\nThe Team Leader should be able to successfully manage day-to-day art production of all artists on his team which are working remotely, providing clear guidance and instructions and promptly communicating information from the client, Art Director or Art Producer to all team members; take all necessary initiatives in problem solving and potential risks identification; follow production schedule providing art deliveries on time and on quality.\nThe Team Leader typically reports to Art Director for Art Work and to Producer for scheduling, resource, and delivery issues. The Team Leader will lead a sub-team in an art working group, and work with other sub-teams in order to guarantee the successful and smooth accomplishment of the project.\n\nResponsibilities\n\n  Review the client’s package to check if there are      any problems with reference materials or requirements.\n  Ensure all artists understand the art      requirements and specific needs of the project\n  Cooperate with Art Director and Producer to      composite the team and estimate the time for the project\n  Analyze the client's brief and workflow document,      propose optimization suggestions, and train the artists on the team\n  Check daily work according to the schedule and      notice Producer about the risks and help to propose solutions\n  Perform daily checks of every artist progress in      order to find and eliminate any possible problems as soon as possible\n  Prepare all assets for Art Director review when      the artist finishes important WIP (working in process) stage, and conduct      a basic quality control review before the Art Director review\n  Ensure that the Artist knows the client’s      feedback perfectly and check whether the Artist is able to implement the      feedback\n  Evaluate the art team performance\n  Evaluate the ability of the artist and set the improvement      target for them\n  Communicate with technical art, explain the      technical assistance requirement, and push the solution implementation\n  Communicate with the client's artist or producer directly\n\nQualifications\n\n  Experience creating photorealistic set pieces,      props, textures, and materials on next-gen console platforms (environment)\n  A minimum of 4 years full-cycle console game      experience in modeling, texturing, and shading environment assets.\n  Two or more published games in an Environment or      Prop Artist role.\n  Ability to show examples of top-notch props and      textures made for next-gen console games\n  Work well in a large team environment, be      proactive, and have excellent communication skills.\n  Deep understanding of the complete game art development      and production pipeline.\n  Master level experience creating the assets      conform to the PC\\console\\mobile game technical specifications with      Autodesk Maya\\3DsMax or Blender.\n  Master level experience using Adobe Photoshop and      Substance Toolsets to create photorealistic textures for next-gen      materials based on concepts and/or photo reference.\n  Zbrush experience for high-res sculpting and      transferring to in-game assets.\n  Deep understanding of next-gen materials and      shader and is able to achieve the desired surface qualities needed across      a variety of environmental assets.\n  Skilled at balancing art quality and performance      in the game engine include and is not limited to the Unreal Engine &      Unity Engine.\n  Experience in Character modeling will be a plus.\n  A passion for making great games.\n"
  },
  {
    "jobTitle": "Environment Art Director – Remote team",
    "companyName": "VIRTUOS HOLDINGS PTE. LTD.",
    "salaryRange": "$6,000 $11,000",
    "jobCategory": "Entertainment",
    "jobLevel": "Manager",
    "employmentType": "Temporary, Permanent, Flexi-work",
    "postedDate": "15 Feb 2023",
    "expiryDate": "01 Mar 2023",
    "minimumExperience": "5 years exp",
    "jobDescription": "About the position\nThe Art Director is required to oversee and support the projects within his field of expertise. The role requires a substantial industry experience in 3D Environment creation for AAA console games, and to demonstrate a wealth of knowledge and comprehension of the many topics within this field of expertise. Excellent in many areas, the position requires the director to guide and ensure that attention to quality, client satisfaction and strong effective communication are maintained on all projects, and that all team members uphold Virtuos values.\nArt Directors are ambassadors and should demonstrate a passionate yet professional manner for their field of expertise and act as an escalation and consultation point as well as an ability to mitigate risk, with an ability to sort through the problems and find reliable solutions.\nArt Directors have the ability to communicate directly with teams and clients in a coherent manner, bringing knowledge and relevant ideas to a discussion. Helping others to digest and comprehend the information while also asking pertinent questions on relevant subjects.\nArt Directors should have an excellent comprehension for the foundations of art and theory that go to create great art, such as, but not limited to composition, light and tone, color theory, scale and proportion, storytelling, spatial relationships. The knowledge should also extend to digital asset creation and pipelines, game engines techniques and materials, level theory and creation, lighting and many other aspects of game art creation.\nThis role will be supervising a remote team and will be supported by local leads reporting to this position as the team grows. This will be unique and dynamic environment where the Art Director will be able to contribute to many new ideas outside of his traditional field of expertise.\n\nResponsibilities\n· Establish and clearly communicate the art vision to the team\n· Provide clear and concise written and illustrated guidelines that communicate art vision of current projects with AD.\n· Collaborate with Design, Engineering and Art teams to make recommendations and decisions regarding overall art vision.\n· Work together with the Art Director to make sure art priorities are effectively defined and processes meet both artistic and scheduling goals.\n· Propose cohesive and holistic solutions to problems.\n· Provide day-to-day artistic feedback and mentorship of individual contributors and leads.\n· Review and approve assets to ensure that quality standards are met, and visual consistency is maintained\n· Work closely with Production to ensure risks are being identified and tracked and assist in the creation and overall management of the art schedule and resource plans.\n· Work with the Art Producer to conduct performance evaluations.\n\nQualifications\n· At least 5 years experience as a Senior Artist, Lead Artist or Art Team Leader with at least 1 AAA console title shipped and a proven record of supervising a team to greater competency and efficiency.\n· An outstanding portfolio demonstrating 3D high quality realistic work\n· Experience working with artists and defining artistic vision\n· Broad knowledge spanning different art disciplines, including concept, character, animation, environment, VFX, UI, lighting, shading, and rendering.\n· Experience with collaborating in leading a team with emphasis collaborating with Senior and Executive level leadership.\n· Extensive experience and knowledge of art processes and video games production pipelines.\n· Excellent eye for graphical quality and knowledge of techniques used to achieve visual targets.\n· Ability to foster a dynamic and collaborative team environment.\n· Excellent decision-making capabilities.\n· Outstanding written and verbal communication skills.\n· A passion for making great games.About the position\n"
  },
  {
    "jobTitle": "Payroll / Accounting Administrator (Remote Working)",
    "companyName": "DARMAX (SG) PRIVATE LIMITED",
    "salaryRange": "$4,000 $8,000",
    "jobCategory": "Accounting / Auditing / Taxation",
    "jobLevel": "Professional",
    "employmentType": "Full Time",
    "postedDate": "15 Feb 2023",
    "expiryDate": "17 Mar 2023",
    "minimumExperience": "3 years exp",
    "jobDescription": "Responsibilities:\n\n  Organize and maintain personnel records\n  Update internal databases (e.g. record sick or maternity leave)\n  Prepare HR documents, like employment contracts and new hire guides\n  Revise company policies\n  Answer employees' queries about HR-related issues\n  Administer payroll for employees in Singapore and Hong Kong office\n  Gather staffing needs from the Head of Departments and create and publish job ads\n  Schedule job interviews, contact, screen, and shortlist candidates as needed\n  Issue invoices to clients\n  Draft terms & conditions when needed\n  Process monthly office and staff expenses\n  Administer group benefits plan for employees\n  Manage accounts receivable and payable\n  Manage the company’s liabilities (e.g. insurance premiums)\n  Ad hoc administrative tasks\n\nRequirements:\n\n  Degree in business administration, finance, or accounting preferred\n  Proven work experience as a Business/Payroll Administrator or similar role\n  Proficiency in Microsoft Office\n  Strong numerical aptitude and attention to detail\n  Excellent communication skills in English, both verbal and written\n  Good time management and organizational skills\n  Flexibility and willingness to learn at all times\n"
  },
  {
    "jobTitle": "Recruiter (Home-Base) - Remote Support",
    "companyName": "STAR CAREER CONSULTING PTE. LTD.",
    "salaryRange": "$3,000 $4,000",
    "jobCategory": "Human Resources",
    "jobLevel": "Executive",
    "employmentType": "Flexi-work",
    "postedDate": "14 Feb 2023",
    "expiryDate": "16 Mar 2023",
    "minimumExperience": "2 years exp",
    "jobDescription": "STAR CAREER is passionate about providing the high-quality service for our clients and candidates, creating a workplace fulfilment where our people will stay, perform and can be successful\nOur esteemed Company is seeking for Independent Recruitment Consultants and new talents who possess the potential to develop into high performers. There are many on-the-job training opportunities in this role as Independent Recruitment Consultant expand their skillsets through collaboration with other recruiters and learn more effective techniques to attract and identify talents.\nYou will enjoy building relationships from a strong team-based support Company culture that rewards and celebrate success together.\n\n\nJob Description -Independent Recruitment Consultant\n(Flexible-Work Arrangement)\nOur esteemed Company is seeking for Independent Recruitment Consultants and new talents who possess the potential to develop into high performers. There are many opportunities for on-the-job training in this role as Independent Recruitment Consultant expand their skillsets through collaboration with other recruiters and learn more effective techniques to attract and identify talents.\nYou will enjoy building relationships from a strong team-based support Company culture that rewards and celebrate success together.\n==============================================================\n\n\nJob Description\nJob Title : Recruiter (Home-Base) - Remote Support\n(Flexible-Work Arrangement / Flexible-Work Mums)\n(Full Commissions)\n\n(Trainings will be given to candidates with NO experience!)\n\n\n\nJob Summary : Recruitment consultants will assist in finding the best people to staff the client’s\nbusiness needs by evaluating candidates and building networks of potential hires,\ntaking on a more hands-on role in assessing candidate resumes and credentials.\nTo understand and match the needs of the clients and candidates to provide quality\nrecruitment services\n\n\nMain Duties and Responsibilities\nCandidate Management\n· Taking on the role of a recruitment consultant to understand clients’ recruitment needs and assist in placing the right talents with their Organization\n· Source candidates using web-based services, job portals data base and social media recruitment methods to network and identify the right candidates for clients’ vacancies\n· Evaluate resumes and applications\n· Assume responsibility of pre-interview screening\n· Provide career advice and consultation to job-seekers\n· Facilitate and finalize agreements for candidates\n\nJob Requirements\n· Able to communicate effectively and professionally\n· Min. 3 years of Recruitment experience will be desire.\n· Highly driven and enthusiastic with positive attitude\n· Good in coordination and liaison work\n· Enjoy engaging with people\n· Good track record in Recruitment Life Cycle\n· Proven experience as Recruitment Consultant, HR Consultant or similar position will be an added advantage\n\n\nApplicants who are not shortlisted may be considered for other similar positions.\n\nIf you have meet the job requirements that we are looking for or wish to find out more on this role, please contact us or apply in-confidence to us with you updated MS Word Resume to : jeline@starcareerconsulting.com\n\n\nYong Zhehan @Yong Jeline (Reg. No. R1101621)\nSTAR CAREER CONSULTING PTE LTD (EA License: 20C0353)"
  },
  {
    "jobTitle": "Data Management Executive (Remote)",
    "companyName": "INCALL SYSTEMS PTE LTD",
    "salaryRange": "$1,600 $1,800",
    "jobCategory": "Others",
    "jobLevel": "Executive",
    "employmentType": "Permanent, Full Time",
    "postedDate": "13 Feb 2023",
    "expiryDate": "15 Mar 2023",
    "minimumExperience": "1 year exp",
    "jobDescription": "Job description\nResponsibilities\n\n  Assist in the updating, extracting and uploading of database for marketing purposes;\n  Perform data de-duplication, manipulation, cleansing, extraction, mapping/matching;\n  Perform queries and list pulls for marketing campaigns;\n  Monitor and perform updating, deduping, clean-up, extracting and uploading of database;\n  Report on campaigns performance, effectiveness, and growth;\n  Produce quantitative reports/presentations and communicate on findings, highlight any inconsistencies / issues;\n  Work with business and IT resources regarding database issues and technical questions;\n  The position responsibilities outlined above are in no way to be construed as all encompassing. Other duties, responsibilities and qualifications may be required and/or assigned as necessary.\n\nRequirements:\n\n  Minimum 1-2 years of relevant database / reporting experience;\n  Minimum Diploma in a relevant field;\n  Highly proficient with Microsoft Excel (E.g.: Pivot Tables, Macros, etc);\n  Understanding of database structure;\n  Basic programming skills will be an advantage;\n  Able to work in a deadline driven environment with the ability to meet aggressive deadlines;\n  Able to handle multiple campaigns assigned;\n  Observes attention-to-detail, meticulous and organized; and\n  Fluent in both spoken and written English.\n\nWe regret that only shortlisted candidates will be notified.\n\nBenefits:\n\n  Work from home\n\nWork Location: Remote"
  },
  {
    "jobTitle": "Customer Success Engineer (Remote work, CCNA, / Satcom / Telecomm)",
    "companyName": "OAKTREE CONSULTING",
    "salaryRange": "$5,000 $6,500",
    "jobCategory": "Engineering, Telecommunications",
    "jobLevel": "Executive",
    "employmentType": "Permanent, Full Time",
    "postedDate": "13 Feb 2023",
    "expiryDate": "15 Mar 2023",
    "minimumExperience": "3 years exp",
    "jobDescription": "Job Duties:\n\n• Ensuring TAC tickets and resolve customer technical complaints within stipulated TTR (Time to Resolve) SLA\n• Update/handle tickets in ticketing system as per TAC handbook, respond to incoming emails, calls, and web requests from customer in a timely manner\n• Execute and lead service interventions such as system upgrades, configuration changes and preventive maintenances\n• Replicate customer problems in lab, escalate issues to engineering when engineering help is required either in debugging or problem has been reproduced in the lab\n• Perform on-site or TAC-Remote network audit for customers\n• Serve Premium or Strategic customer as a Technical Account Manager (TAM)\n• Assist the team with escalations as and when required\n• Assist customers in planned major network maintenances\n• Participate in rotating shift duties to support 7x24x365 operations\n• Deliver basic and advance training to iDirect customers\n• Maintain and upgrade the training lab to the latest software release as and when required\n• Provide feedback to the content developer on training material for continuous improvement\n• Work with internal and external customers to make sure all requirements are met\n• Able to travel in short notice when needed\n\n\nJob Requirements:\n• Minimum bachelor’s degree in Electrical/ Electronics/Telecommunications Engineering\n• Minimum of 3-5 years working experience in SATCOM industry\n• Working knowledge or practical experience with\n· IP-based networks with a CCNA certification or above\n· SATCOM knowledge and experience\n· Knowledge with programming language or scripting experience (added advantage)\n• Problem solving skills, analytical skills, and the ability to make decisions quickly\n• Meticulous and process orientated\n• Excellent customer service skills\n• Position based in Singapore/remotely\n\n\n\nPlease submit resumes to john@oaktree.com.sg with the following details in MS Word format:\n\n- Position applying for\n- Current remuneration\n- Expected remuneration\n- Notice period\n\n\nJohn Goh Meng Chye\nEA License No : 06C4642\nEA Reg No : R1102621\n\n\nWe regret that only shortlisted candidates will be notified."
  },
  {
    "jobTitle": "Mathematics Teacher (Remote Working)",
    "companyName": "SPARK EDTECH PTE. LIMITED",
    "salaryRange": "$3,500 $5,500",
    "jobCategory": "Education and Training",
    "jobLevel": "Executive",
    "employmentType": "Permanent, Full Time",
    "postedDate": "13 Feb 2023",
    "expiryDate": "15 Mar 2023",
    "minimumExperience": "1 year exp",
    "jobDescription": "We are currently looking for highly-passionate, committed and responsible Online Math Teacher(s) who are familiar with the Singapore Mathematics Syllabus to implement an approved curriculum in an online learning environment that encourages students to fulfill their academic potential.\nOur ideal candidate will tailor educational plans to help all students develop intellectually, socially, and emotionally. The goal is to help cultivate the students’ interest in education and be their dedicated ally in the entire process of learning and development.\n\nJob Responsibilities:\n\n  Plan, prepare, and deliver lessons, promoting the general progress and well-being of students\n  Create an online classroom culture that is welcoming and positive\n  Utilize a wide variety of teaching methods to create differentiated opportunities for deep understanding for all learners\n  Drive outstanding student achievement for all students in your classroom\n  Establish and maintain good relationships with students and parents.\n  Provide regular updates to parents on students’ performance and progress.\n  Assess, record and report on development and progress of students\n  Attend and participate in curriculum meetings and trainings\n\nWe would love for you to have/be:\n\n  Diploma or Bachelor's Degree in Education with relevant specialization\n  1-3 years relevant professional teaching experience\n  Outstanding verbal, non-verbal and written skills\n  Excellent interpersonal, organization and time management skills\n  Creative, positive and energetic disposition\n  Continually strive for improvement\n  Computer-literate\n\nAs you will be working from home, you will be required to have:\n\n  A personal computer with a built-in or separate webcam\n  Headset fitted with a microphone\n  Quick and steady internet connection\n  A well-lit, distraction-free environment from which to conduct your lessons\n"
  },
  {
    "jobTitle": "IT Engineer - Remote Support (BANK)**Training Provided",
    "companyName": "SMART FORTE CONSULTING LLP",
    "salaryRange": "$2,500 $3,000",
    "jobCategory": "Information Technology",
    "jobLevel": "Fresh/entry level",
    "employmentType": "Full Time",
    "postedDate": "10 Feb 2023",
    "expiryDate": "12 Mar 2023",
    "minimumExperience": "",
    "jobDescription": "\n  First point of contact regards to any IT issues face by bank users\n  Provide solutions to simple issues reported by bank users over remote assist by phone or network remote control. Escalate complicated issues to the next level.\n  Provide remote technical assistance and support related to computer systems, hardware, or software.\n  Responds to queries, runs diagnostic programs, isolates problems, determines and implements solution.\n  Applies understanding and knowledge of information systems products and services to assist users.\n  Identify and investigate user questions and problems as well as isolating and resolving information system problems.\n  Prioritizes issues using appropriate escalation procedures, and coordinates referrals to technical, professional, or service personnel as needed.\n  Evaluating alternative approaches and selecting optimal approaches.\n  Focus on SLA and resolution process.\n\nJob Requirements\n\n  Diploma / Nitec in Information Technology, Computer Engineering or relevant\n  Welcome entry level - Training Provided\n  Bank work environment at Raffles Place\n  $2500 - $3000\n  Start work immediately or within short notice\n\nInterested applicants please submit your resume. Shortlisted candidates will be contacted very soon. Thank you."
  },
  {
    "jobTitle": "Leasing Executive (Remote with flexi hours)",
    "companyName": "COLD STORAGE SINGAPORE (1983) PTE LTD",
    "salaryRange": "$3,000 $3,800",
    "jobCategory": "Real Estate / Property Management",
    "jobLevel": "Executive",
    "employmentType": "Permanent",
    "postedDate": "10 Feb 2023",
    "expiryDate": "12 Mar 2023",
    "minimumExperience": "2 years exp",
    "jobDescription": "Reporting into Network Planning Manager, the role is primarily focused on the development of new stores from potential site assessment to store opening. The incumbent will work closely with Leasing and Operations team as part of a multi-functional team. The aim is to uphold 7-Eleven’s market position as the largest Convenience Chain in Singapore, achieving Year on Year Store growth.\n\nKEY RESPONSIBILITIES\n1. Complete feasibility assessment of sites recommended by Leasing Department; this includes the study of the location’s traffic count, demographics, and detailed perimeter investigation.\n2. Submit Assessments and Recommendations of new sites for store expansion to Network Planning Manager during Weekly New Site Meeting\n3. Put forth to Operations Managers shortlisted sites to gather projected sales\n4. Work closely with Group Insights Team to improve Assessment Model and sales forecast accuracy.\n5. Review and Communicate Store completion progress by attending weekly meeting and conducting site visits.\n6. Participate in Post Store Opening Evaluation.\n7. Complete special projects or other duties as assigned.\n\nKEY REQUIREMENTS\n• Desire to learn from subject matter experts within the development team. Experience in the Retail Industry is a plus.\n• Strong interpersonal and people management skills will be an advantage as the candidate is required to interact with various departments’ representatives.\n• Attention to details and able to work independently.\n• Good verbal and written skills.\n• Proficient in Microsoft Offices (PowerPoint and Excel)\n\n• This role will require the incumbent to work remotely (traveling within Singapore) and few hours during weekends"
  },
  {
    "jobTitle": "Remote Control Center (RCC) Operations Manager",
    "companyName": "OCEAN INFINITY PTE. LTD.",
    "salaryRange": "$15,000 $15,001",
    "jobCategory": "General Management",
    "jobLevel": "Manager",
    "employmentType": "Permanent",
    "postedDate": "08 Feb 2023",
    "expiryDate": "10 Mar 2023",
    "minimumExperience": "5 years exp",
    "jobDescription": "We are a technology company transforming operations at sea to enable people and the planet to thrive.\n\nWe are open-minded and fearless in our approach to innovation and don't believe in boundaries. We challenge everything and have massive ambitions to drag aging industries into the tech era.\n\nWe take safety, equality, and education very seriously, and our responsibilities don't stop at our front door. Our business is built on the belief that there's definitely a more environmentally responsible way to operate at sea.\n\nWe only employ the best people. People with a desire for excellence, a curious nature, thoughtful, humble, collaborative, and accountable.\n\nWe reward our people well. Beyond what's usually considered to be the 'market average'.\n\nThe opportunities for people in our business can be limitless, spanning many disciplines and open to all, regardless of background and experience level.\n\nRemote Control Center (RCC) Operations Manager is an experienced person from marine operations who is open-minded and who embraces new technology and new ways of working. The person will be leading an industry-changing transition from sea to shore and will be responsible for building a strong team in the Remote Control Center in close collaboration with the Fleet Management team and the payload operations team.\n\nJob Description:\n\n\n  Build and implement robust RCC procedures and routines that facilitate the transition from operations at sea to shore;\n  Constantly strive for improvements and more efficient ways of working;\n  Plan and execute cross-training of personnel;\n  Identify and build new roles to satisfy the new operational needs of the company;\n  Build and plan for in-house manning capacity with a view to reducing the use of manning agencies to a minimum;\n  Ensure the RCC operations are well planned and conducted safely and with sufficient redundancy in terms of personnel availability and skillset;\n  Build a truly global operational RCC capability;\n  Work closely with flag states, unions, and other stakeholders to drive the legislation and perception of the RCC operations in a desired way.\n\nQualifications:\n\n\n  Operational marine experience in a senior role;\n  Experience in building training programs;\n  Experience in change management;\n  Strong understanding of quality management such as standards, regulations, and applicable policies and procedures;\n  Good practical experience with office tools: MS Office, Sharepoint, Teams, and e-mail, among others\n  Interested in others and strives for the best for the team; Ability to take ownership and engagement in the work;\n  Integrity, credibility, and maturity for confidential issues;\n  Ability to work as a trusted advisor with senior stakeholders;\n  Excellent time management skills and ability to prioritize work in a fast-paced environment;\n  Strong leadership skills;\n  Strong interpersonal and people management skills;\n  Strong communication skills;\n  Driven, proactive, and able to work autonomously with little supervision toward the company's purpose;\n  Critical thinking and ability to show initiative;\n  Open and receptive to new and different ideas;\n  Ability to work well in a team and independently;\n  Enthusiastic about protecting people and the planet\n\nIf interested, please submit your CV to : careers@oceaninfinity.com \n\n"
  },
  {
    "jobTitle": "Customer Success Engineer (Remote work, CCNA, / Satcom / Telecomm)",
    "companyName": "OAKTREE CONSULTING",
    "salaryRange": "$5,000 $6,500",
    "jobCategory": "Engineering, Telecommunications",
    "jobLevel": "Executive",
    "employmentType": "Permanent, Full Time",
    "postedDate": "07 Feb 2023",
    "expiryDate": "09 Mar 2023",
    "minimumExperience": "3 years exp",
    "jobDescription": "Job Duties:\n\n• Ensuring TAC tickets and resolve customer technical complaints within stipulated TTR (Time to Resolve) SLA\n• Update/handle tickets in ticketing system as per TAC handbook, respond to incoming emails, calls, and web requests from customer in a timely manner\n• Execute and lead service interventions such as system upgrades, configuration changes and preventive maintenances\n• Replicate customer problems in lab, escalate issues to engineering when engineering help is required either in debugging or problem has been reproduced in the lab\n• Perform on-site or TAC-Remote network audit for customers\n• Serve Premium or Strategic customer as a Technical Account Manager (TAM)\n• Assist the team with escalations as and when required\n• Assist customers in planned major network maintenances\n• Participate in rotating shift duties to support 7x24x365 operations\n• Deliver basic and advance training to iDirect customers\n• Maintain and upgrade the training lab to the latest software release as and when required\n• Provide feedback to the content developer on training material for continuous improvement\n• Work with internal and external customers to make sure all requirements are met\n• Able to travel in short notice when needed\n\n\nJob Requirements:\n• Minimum bachelor’s degree in Electrical/ Electronics/Telecommunications Engineering\n• Minimum of 3-5 years working experience in SATCOM industry\n• Working knowledge or practical experience with\n· IP-based networks with a CCNA certification or above\n· SATCOM knowledge and experience\n· Knowledge with programming language or scripting experience (added advantage)\n• Problem solving skills, analytical skills, and the ability to make decisions quickly\n• Meticulous and process orientated\n• Excellent customer service skills\n• Position based in Singapore/remotely\n\n\n\nPlease submit resumes to john@oaktree.com.sg with the following details in MS Word format:\n\n- Position applying for\n- Current remuneration\n- Expected remuneration\n- Notice period\n\n\nJohn Goh Meng Chye\nEA License No : 06C4642\nEA Reg No : R1102621\n\n\nWe regret that only shortlisted candidates will be notified."
  },
  {
    "jobTitle": "Finance Mgr, Asst Mgr for Scaling Tech Startup (Fully Remote)",
    "companyName": "HUMAN CAPITAL ALPHA PTE. LTD.",
    "salaryRange": "$5,000 $7,000",
    "jobCategory": "Accounting / Auditing / Taxation",
    "jobLevel": "Manager",
    "employmentType": "Permanent",
    "postedDate": "07 Feb 2023",
    "expiryDate": "09 Mar 2023",
    "minimumExperience": "4 years exp",
    "jobDescription": "Finance Mgr, Asst Mgr for Scaling Tech Startup (Fully Remote)\n\nThis is an exciting opportunity for an entrepreneurial candidate to join a scaling tech startup with a strong mandate to grow within the region.\n\nReporting directly to the Company's partners, you will manage financial oversight of the company and play a key role in leading financial decision-making.\n\nResponsibilities\n\n  Financial Reporting & Analysis (including reelvant forecasting and modelling)\n  Oversee bugeting and forecasting cycle in line with management reporting requirements\n  Handle financial operations      including claims and payments\n\n‍Qualifications\n\n  4-6 years of accounting and finance experience\n  Degree in Accounting, Finance, or related field.\n  ACCA fully qualified/CPA part or fully qualified preferably.\n  Familiarity with local financial reporting standards\n  Excellent verbal and written      communications skills\n\n\nEA License No. 15C7420\nEA Reg No: R1218187\n\nDate ad posted: 2023-02-07\n"
  },
  {
    "jobTitle": "Senior Backend Developer (Remote)",
    "companyName": "RANDSTAD PTE. LIMITED",
    "salaryRange": "$7,000 $9,000",
    "jobCategory": "Information Technology",
    "jobLevel": "Senior Executive",
    "employmentType": "Permanent",
    "postedDate": "03 Feb 2023",
    "expiryDate": "05 Mar 2023",
    "minimumExperience": "3 years exp",
    "jobDescription": "About the company\nWe're a global cybersecurity company that empowers fast-growing companies to streamline their secure software development processes.Due to the expansion plans, we are looking to hire multiple backend developers within the team.\n\nAbout the job\n\n  You will continuously contribute to our platform to ensure that our backend services are fast, reliable and scalable.\n  Developing ambitious features and functionality in line with our product roadmap.\n  You are opinionated about how Internet scale backends are engineered and happy to have constructive conversations with the team on how to continuously improve our platform.\n\nAbout the manager/team\nYou will work together with product managers, designers, and frontend and backend engineers towards aligned goals.\n\nSkills and experience required\nYou will need to have min diploma/degree in computer science or related fields. Other requirements are as follow:\n\n  Excellent NodeJS (TypeScript) coding skills\n  Able to write maintainable, well tested, secure and performant code\n  Have a good understanding of the different database types (NoSQL, SQL, Key-Value, ...) and are able to write maintainable and optimized queries\n\nInterested candidates please send your updated CV to steve.ling@randstad.com.g and we could have a quick chat to discuss it further.\n(EA: 94C3609/ R1332781)"
  },
  {
    "jobTitle": "IT Engineer - Remote Support (BANK)**Training Provided",
    "companyName": "SMART FORTE CONSULTING LLP",
    "salaryRange": "$2,500 $3,000",
    "jobCategory": "Information Technology",
    "jobLevel": "Fresh/entry level",
    "employmentType": "Full Time",
    "postedDate": "01 Feb 2023",
    "expiryDate": "03 Mar 2023",
    "minimumExperience": "",
    "jobDescription": "\n  First point of contact regards to any IT issues face by bank users\n  Provide solutions to simple issues reported by bank users over remote assist by phone or network remote control. Escalate complicated issues to the next level.\n  Provide remote technical assistance and support related to computer systems, hardware, or software.\n  Responds to queries, runs diagnostic programs, isolates problems, determines and implements solution.\n  Applies understanding and knowledge of information systems products and services to assist users.\n  Identify and investigate user questions and problems as well as isolating and resolving information system problems.\n  Prioritizes issues using appropriate escalation procedures, and coordinates referrals to technical, professional, or service personnel as needed.\n  Evaluating alternative approaches and selecting optimal approaches.\n  Focus on SLA and resolution process.\n\nJob Requirements\n\n  Diploma / Nitec in Information Technology, Computer Engineering or relevant\n  Welcome entry level - Training Provided\n  Bank work environment at Raffles Place\n  $2500 - $3000\n  Start work immediately or within short notice\n\nInterested applicants please submit your resume. Shortlisted candidates will be contacted very soon. Thank you."
  },
  {
    "jobTitle": "Customer Success Engineer (Remote work, CCNA, / Satcom / Telecomm)",
    "companyName": "OAKTREE CONSULTING",
    "salaryRange": "$5,000 $6,500",
    "jobCategory": "Engineering, Telecommunications",
    "jobLevel": "Executive",
    "employmentType": "Permanent, Full Time",
    "postedDate": "01 Feb 2023",
    "expiryDate": "03 Mar 2023",
    "minimumExperience": "3 years exp",
    "jobDescription": "Job Duties:\n\n• Ensuring TAC tickets and resolve customer technical complaints within stipulated TTR (Time to Resolve) SLA\n• Update/handle tickets in ticketing system as per TAC handbook, respond to incoming emails, calls, and web requests from customer in a timely manner\n• Execute and lead service interventions such as system upgrades, configuration changes and preventive maintenances\n• Replicate customer problems in lab, escalate issues to engineering when engineering help is required either in debugging or problem has been reproduced in the lab\n• Perform on-site or TAC-Remote network audit for customers\n• Serve Premium or Strategic customer as a Technical Account Manager (TAM)\n• Assist the team with escalations as and when required\n• Assist customers in planned major network maintenances\n• Participate in rotating shift duties to support 7x24x365 operations\n• Deliver basic and advance training to iDirect customers\n• Maintain and upgrade the training lab to the latest software release as and when required\n• Provide feedback to the content developer on training material for continuous improvement\n• Work with internal and external customers to make sure all requirements are met\n• Able to travel in short notice when needed\n\n\nJob Requirements:\n• Minimum bachelor’s degree in Electrical/ Electronics/Telecommunications Engineering\n• Minimum of 3-5 years working experience in SATCOM industry\n• Working knowledge or practical experience with\n· IP-based networks with a CCNA certification or above\n· SATCOM knowledge and experience\n· Knowledge with programming language or scripting experience (added advantage)\n• Problem solving skills, analytical skills, and the ability to make decisions quickly\n• Meticulous and process orientated\n• Excellent customer service skills\n• Position based in Singapore/remotely\n\n\n\nPlease submit resumes to john@oaktree.com.sg with the following details in MS Word format:\n\n- Position applying for\n- Current remuneration\n- Expected remuneration\n- Notice period\n\n\nJohn Goh Meng Chye\nEA License No : 06C4642\nEA Reg No : R1102621\n\n\nWe regret that only shortlisted candidates will be notified."
  },
  {
    "jobTitle": "Customer Success Engineer (Remote work, CCNA, / Satcom / Telecomm)",
    "companyName": "OAKTREE CONSULTING",
    "salaryRange": "$5,000 $6,500",
    "jobCategory": "Engineering, Telecommunications",
    "jobLevel": "Executive",
    "employmentType": "Permanent, Full Time",
    "postedDate": "01 Feb 2023",
    "expiryDate": "03 Mar 2023",
    "minimumExperience": "3 years exp",
    "jobDescription": "Job Duties:\n\n• Ensuring TAC tickets and resolve customer technical complaints within stipulated TTR (Time to Resolve) SLA\n• Update/handle tickets in ticketing system as per TAC handbook, respond to incoming emails, calls, and web requests from customer in a timely manner\n• Execute and lead service interventions such as system upgrades, configuration changes and preventive maintenances\n• Replicate customer problems in lab, escalate issues to engineering when engineering help is required either in debugging or problem has been reproduced in the lab\n• Perform on-site or TAC-Remote network audit for customers\n• Serve Premium or Strategic customer as a Technical Account Manager (TAM)\n• Assist the team with escalations as and when required\n• Assist customers in planned major network maintenances\n• Participate in rotating shift duties to support 7x24x365 operations\n• Deliver basic and advance training to iDirect customers\n• Maintain and upgrade the training lab to the latest software release as and when required\n• Provide feedback to the content developer on training material for continuous improvement\n• Work with internal and external customers to make sure all requirements are met\n• Able to travel in short notice when needed\n\n\nJob Requirements:\n• Minimum bachelor’s degree in Electrical/ Electronics/Telecommunications Engineering\n• Minimum of 3-5 years working experience in SATCOM industry\n• Working knowledge or practical experience with\n· IP-based networks with a CCNA certification or above\n· SATCOM knowledge and experience\n· Knowledge with programming language or scripting experience (added advantage)\n• Problem solving skills, analytical skills, and the ability to make decisions quickly\n• Meticulous and process orientated\n• Excellent customer service skills\n• Position based in Singapore/remotely\n\n\n\nPlease submit resumes to john@oaktree.com.sg with the following details in MS Word format:\n\n- Position applying for\n- Current remuneration\n- Expected remuneration\n- Notice period\n\n\nJohn Goh Meng Chye\nEA License No : 06C4642\nEA Reg No : R1102621\n\n\nWe regret that only shortlisted candidates will be notified."
  },
  {
    "jobTitle": "Software Engineer (Remote)",
    "companyName": "R VANTAGE PTE. LTD.",
    "salaryRange": "$4,000 $8,000",
    "jobCategory": "Engineering",
    "jobLevel": "Manager",
    "employmentType": "Permanent, Full Time",
    "postedDate": "01 Feb 2023",
    "expiryDate": "03 Mar 2023",
    "minimumExperience": "3 years exp",
    "jobDescription": "Roles and Responsibilities:\n\n  Develop, Document and maintain new API endpoints and front-end features.\n  Produce high quality complex deliverables with minimal input and supervision\n  Participate in the development process from definition to deployment.\n  Build internal tooling to improve development efficiency\n  Write review and maintain code using relevant design patterns on a full software stack.\n  Translate designs and wireframes into high quality full stack code (React, Ruby).\n  Design overall architecture of the web/backend/mobile application.\n  Perform code reviews for team deliverables to ensure code follows documented standards and best practices.\n  Help evolve systems architecture to consistently improve development efficiency.\n  Work with product owners and end-users to clarify specifications and get feedback.\n  Collaborate with other engineers and designers to develop and ship features.\n"
  },
  {
    "jobTitle": "Remote Support (Central / POS Solutions / UP$2800 / 5 Days / Training Provided / VB) - BN",
    "companyName": "MCI CAREER  SERVICES PTE. LTD.",
    "salaryRange": "$1,800 $2,800",
    "jobCategory": "Information Technology",
    "jobLevel": "Fresh/entry level",
    "employmentType": "Permanent",
    "postedDate": "27 Jan 2023",
    "expiryDate": "26 Feb 2023",
    "minimumExperience": "",
    "jobDescription": "Benefits Summary:\n•\tPOS Solutions\n•\t44 hours work week, with a rotating schedule varying 8-hours shift starting anytime between 7.00am-11.00am\n•\tUP$2800\n•\tCentral\n•\tVariable bonuses\n\nResponsibilities:\n•\tAssist clients on their requirements\n•\tGuide clients on how to utilise / achieve features\n•\tFeedback to developers and resolve issues\n•\tAdministrative duties\n\nAdditional Information:\n•\tAble to work on a flexible schedule based on operational needs\n•\tTraining provided\n\nApplicants who possess relevant experience for the above responsibilities are most welcome to apply. If you do not possess the above experience, your application will still be considered on individual merits and you may be contacted for other opportunities.\n\nFor quick response, applicants who express interest in this job advertisement, kindly contact 91168310 in the following format,\n\nPosition: Remote Support (L)\nFull Name:\nArea of stay:\nStart date:\n\nBy submitting your personal data and/or resume, you give consent to the collection, use and disclosure of your personal data and/or resume by the company (or its agent) for the purpose of the processing and administration by the company relating to this job application.\n\n**We regret to inform that only shortlisted candidates would be notified.**\n\nWe wish you all the best in your career search.\n\nNg Yi Jie Benedict\nRegistration Number: R2091806\nEA Licence No: 06C2859\n(MCI Career Services Pte Ltd)"
  },
  {
    "jobTitle": "Team Lead (Hybrid / Remote)",
    "companyName": "BCD TRAVEL SINGAPORE PTE. LTD.",
    "salaryRange": "$5,500 $6,000",
    "jobCategory": "Travel / Tourism",
    "jobLevel": "Senior Executive",
    "employmentType": "Full Time",
    "postedDate": "26 Jan 2023",
    "expiryDate": "25 Feb 2023",
    "minimumExperience": "3 years exp",
    "jobDescription": "Bring your passion and energy to our growing team. We’re hiring!\n\nTeam Lead (Hybrid/Remote)\nFull time, Singapore\n\nAs a Team Lead, you are responsible for day-to-day management of a travel consultant team, including managing key performance indicators (KPI), workload, providing assistance and coaching. He/She is also responsible for accurately and efficiently handling incoming requests via multiple channels (i.e. phone, email, etc.) and handling additional duties as assigned.\n\nThe travel consultant is this primary point of contact for the customer and provides active travel consultation towards the business customers, including providing travel details and up-selling of related product.\n\nThis position demonstrates an extensive understanding and applicability of all areas in the travel industry. Works independently on requests as assigned and takes the initiative to provide assistance.\n\n1. Handle Incoming Requests:\n\n  Expertly use the appropriate the BCD Travel tools and systems to complete requests which include search and confirm travel reservations for the traveler\n  Strong understanding of a client travel policy and can appropriately guide and consistently provide consultation to the customer\n  Provide travel offers and general travel advice to travelers\n  Responds to requests accurately and completely\n  Excellent knowledge and application of travel supplier rules\n  Maintains, actively communicates and seeks expansion of current knowledge of the state of the various travel industries supported\n  Provides the customer with the required industry information, such as low fares, exchange costs and penalties\n  Fulfill all requests regarding necessary regulations (DOT, TSA, passports, visas, etc.)\n  Supports BCD Travel and client driven initiatives\n\n\n2. Problem Solving:\n\n  Appropriately responds and resolves customers inquiries\n  Anticipates and provides assistance on potential challenges that may arise for the customer\n  Performs follow-up as needed and within the time frame promised to the customer\n  Proactively provides feedback to management to avoid future customer issues\n  Accurately logs the complaint in the BCD Travel systems\n  Appropriately displays empathy and acknowledging statements to diffuse emotion during adversity\n  Responds and follows through on customer inquiries and complaints received directly or from management (Account or Operational)\n  Anticipate potential issues and work to proactively resolve them\n  Review team issues, determine root causes, alternative solutions and provide feedback to the individual and the team\n\n3. Quality:\n\n  Consistently exceeds individual goals\n  Monitors, sorts and works global distribution systems (GDS) queues daily to maintain quality control\n  Effectively uses the telephone systems\n  Completes reservations with a few errors\n  Consistently follows BCD Travel call/email guidelines\n  Research errors to determine the root cause, recommends and executes solutions \n  Monitors and provides feedback on errors made by the team\n\n4. Service Excellence:\n\n  Responds to the customer promptly\n  Always provides the customer his/her undivided attention to the request\n  Always listens, does not ask the customer to repeat information he/she already provided and applies the information to the inquiry\n  Responds appropriately and asks questions targeted to encourage complete responses\n  Creates rapport with the customer, by showing interest, having a friendly tone of voice, using the customer's name appropriately and making the most of small talk\n  Matches the customer's tone and pace as appropriate\n  Keeps the interaction moving forward\n  Offers suggestions to the customer and anticipates needs\n  Is mindful of the client service level agreement in all transactions\n\n5. Teamwork:\n\n  Seeks opportunities to review operational processes and the commercial relationship with customer and provides suggestions for improvement\n  Volunteers for additional administrative tasks\n  Always searches for opportunities to move market share to BCD Travel preferred suppliers\n  Seeks opportunities to helps team members\n  Provides a team of travel consultants feedback, including responding to questions, providing direction and feedback\n  Ensures team members are kept up to date with new polices, procedures and announcements\n  Oversees and assists the team members in balancing priorities and managing their workload so team KPIs are consistently achieved\n  Works with performance data to maximum the effectiveness and efficiency of the team\n  Creates a positive work environment\n\n6. Communication:\n\n  Uses positive language and word choices to avoid negative customer reactions\n  Avoids jargon or clichés\n  Matches the customer's tone and pace\n  Applies proper communication guidelines (clear, concise and personal) to interactions\n  Uses correct grammar in interactions\n\n7. General Management Responsibilities:\n\n  Manages all key performance metrics evaluating or implementing and reviewing measurements, coaching and continuous improvement\n  Responsible for all assigned administrative tasks\n  Leads change efforts, providing information and communication\n  Delegates work to others for improved results and individual growth as applicable\n\n8. Administrative Tasks:\n\n  Performs quality management such as error management\n  Completes administrative tasks as assigned\n  Assists or oversees testing or researching root causes and develops suggestions for improvement\n  Assists in projects as assigned (ex: implementations)\n  Attend scheduled meetings or calls as assigned\n  Conducts meetings and training sessions as appropriate\n  Aids in Disaster Recovery plans and efforts\n  Manages day-to-day needs of the team and provides assistance and direction\n\n9. Other:\n\n  This job description is not designed to contain a comprehensive listing of activities, duties or responsibilities that are required for this position.  The employee may be asked to perform other duties and responsibilities, as necessary.\n\nAbout you\nEssential:\n· Bachelor degree, or equivalent work experience\n· Minimum of 3-5 plus years experience in the corporate travel management industry\n· Solid working knowledge of the travel industry, policies, procedures and processes\n· Advanced skills on travel industry systems (i.e. GDS)\n· Strong verbal and written communication skills in designated languages\n· Proven ability to handle multiple priorities  simultaneously\n· Ability to work flexible hours\n· Ability to work independently, exercising discretion and judgment\n· Demonstrated excellent professional customer service and problem resolution skills\n· Strong problem solving and/or critical thinking skills\nPreferred:\n· Proficiency in Microsoft Office applications\n· Demonstrated internet research skills for customer information\n· Degree in tourism-related field\n\nAbout us\n We’re a market leader in travel management: We help people and companies travel smart and achieve more, and our clients include some of the world’s best-known and most innovative business and consumer brands. We operate in more than 100 countries, and the majority of our 10,000+ people work virtually (because a 10-second commute usually makes awesome sense). We’re committed to sustainability and to driving success for our customers, our business and ourselves. Learn more about BCD Travel.\n\nYour life at BCD\nWorking at BCD means connecting, collaborating and celebrating. You’ll be part of a virtual, dynamic and flexible work environment that fosters a good work-life balance so you can focus on what makes you happy. But don’t just take our word for it! Hear why people join BCD and more about the great perks of Life at BCD.\nYou’ll be offered\n\n  Flexible working hours and work-from-home or remote opportunities\n  Opportunities to grow your skillset and career\n  Generous vacation days so you can rest and recharge\n  A compensation package that feels fair to you, including mental, physical, and financial wellbeing tools\n  Travel industry professional perks and discounts\n  An inclusive work environment where diversity is celebrated\n\nReady to join the journey? Apply now!\nWe’re dedicated to building a diverse, inclusive and authentic workplace. If you’re excited about a role, but your experience doesn’t align perfectly, we encourage you to apply. You may be just the right candidate for this or other positions."
  },
  {
    "jobTitle": "Customer Success Engineer (Remote work, CCNA, / Satcom / Telecomm)",
    "companyName": "OAKTREE CONSULTING",
    "salaryRange": "$5,000 $6,500",
    "jobCategory": "Engineering, Telecommunications",
    "jobLevel": "Executive",
    "employmentType": "Permanent, Full Time",
    "postedDate": "25 Jan 2023",
    "expiryDate": "24 Feb 2023",
    "minimumExperience": "3 years exp",
    "jobDescription": "Job Duties:\n\n• Ensuring TAC tickets and resolve customer technical complaints within stipulated TTR (Time to Resolve) SLA\n• Update/handle tickets in ticketing system as per TAC handbook, respond to incoming emails, calls, and web requests from customer in a timely manner\n• Execute and lead service interventions such as system upgrades, configuration changes and preventive maintenances\n• Replicate customer problems in lab, escalate issues to engineering when engineering help is required either in debugging or problem has been reproduced in the lab\n• Perform on-site or TAC-Remote network audit for customers\n• Serve Premium or Strategic customer as a Technical Account Manager (TAM)\n• Assist the team with escalations as and when required\n• Assist customers in planned major network maintenances\n• Participate in rotating shift duties to support 7x24x365 operations\n• Deliver basic and advance training to iDirect customers\n• Maintain and upgrade the training lab to the latest software release as and when required\n• Provide feedback to the content developer on training material for continuous improvement\n• Work with internal and external customers to make sure all requirements are met\n• Able to travel in short notice when needed\n\n\nJob Requirements:\n• Minimum bachelor’s degree in Electrical/ Electronics/Telecommunications Engineering\n• Minimum of 3-5 years working experience in SATCOM industry\n• Working knowledge or practical experience with\n· IP-based networks with a CCNA certification or above\n· SATCOM knowledge and experience\n· Knowledge with programming language or scripting experience (added advantage)\n• Problem solving skills, analytical skills, and the ability to make decisions quickly\n• Meticulous and process orientated\n• Excellent customer service skills\n• Position based in Singapore/remotely\n\n\n\nPlease submit resumes to john@oaktree.com.sg with the following details in MS Word format:\n\n- Position applying for\n- Current remuneration\n- Expected remuneration\n- Notice period\n\n\nJohn Goh Meng Chye\nEA License No : 06C4642\nEA Reg No : R1102621\n\n\nWe regret that only shortlisted candidates will be notified."
  },
  {
    "jobTitle": "Accounts & HR Executive (Remote)",
    "companyName": "PRELUDIO PRIVATE LIMITED",
    "salaryRange": "$1,200 $1,500",
    "jobCategory": "Accounting / Auditing / Taxation, Admin / Secretarial, General Management, Human Resources, Insurance",
    "jobLevel": "Executive",
    "employmentType": "Contract, Flexi-work, Freelance, Part Time",
    "postedDate": "20 Jan 2023",
    "expiryDate": "19 Feb 2023",
    "minimumExperience": "3 years exp",
    "jobDescription": "Overview\nCome work at Preludio, a contemporary fine dining concept located in an exclusive tranquil oasis in the CBD. We are looking to hire a part-time Accounts & HR Executive to manage our restaurant's administrative duties. You will be working directly with the directors of the company.\nAccounting\n\n  Bookkeeping in MYOB accounting system, monthly (up to 150 bank transactions per month)\n  Audits & tax return filings (GST and VAT), annually\n  Establishing and reconciling all operating bank accounts\n  Prepare financial reports, forecasting, budgeting and statutory reports, monthly:Profit & Loss Statement\nVariance comparison of Budget vs Actual\nCash Flow Statement\nBudget Report update\nBalance Sheet (generate from MYOB)\nTrade Creditors Listing (generate from MYOB)\n\n  Manage timely closing process and reconciliations, monthly:GTO submission to landlord\nGIRO payments (CPG, FWL, GST, etc...)\nCPF submission\nSales entry\n\n  GST submission, quarterly (next filing: Jan 2022)\n  Prepare and review budget, revenue, expense, payroll entries, invoices, and other accounting documents\n  Resolve accounting discrepancies\n  Oversee, review & implement an effective system of internal control procedures and reporting\n  Interact with internal and external auditors in completing audits\n  Search for government grants applicable to SME\n  Perform ad-hoc duties such as client invoicing, payments, refunds, etc...\n  Attend management meetings with directors via video call, monthly\n\nHuman Resources\n\n  Payroll for 15-20 employees and payslip generation\n  CPF submission, monthly\n  Recruiting: posting of jobs on portals, forwarding resumes to hiring manager, preparation of employee contracts\n  Work Pass: applications, renewals and cancellations\n  Employee records: update and maintenance\n  Leave: administration and tracking\n  Insurance: update coverage for employees\n  General administrative support: company letters, memo issuance, etc...\n  Performance management review\n\nJob Requirements\n\n  Excellent level of proficiency in English\n  A diploma or degree in accountancy, finance or economics\n  The ability to manage multiple tasks and priorities successfully\n  Experience in working in highly collaborative, fast-paced environments\n  Basic knowledge of Human Resources\n"
  },
  {
    "jobTitle": "Embedded Employee Engagement Specialist - APAC (Remote)",
    "companyName": "PINKERTON (SINGAPORE) PTE LTD",
    "salaryRange": "$3,000 $5,000",
    "jobCategory": "Admin / Secretarial",
    "jobLevel": "Professional",
    "employmentType": "Full Time",
    "postedDate": "19 Jan 2023",
    "expiryDate": "18 Feb 2023",
    "minimumExperience": "3 years exp",
    "jobDescription": "Job Summary:\nThe Embedded Employee Engagement Specialist will proactively communicate with Pinkerton Dedicated Professionals (PDPs) within the APAC region to promote an engaged, connected and successful community of Pinkerton security and risk management professionals. Areas of engagement will include: support available; development opportunities; and connectivity to Pinkerton. The Specialist will collaborate with their Center of Excellence (CoE) colleagues and other Pinkerton stakeholders to identify gaps/needs identified as part of their outreach, and implement remedial action and future forward initiatives. \n\nEssential Functions:\n\n  Represent Pinkerton's core values of integrity, vigilance, and excellence.\n  Proactively engage with Pinkerton Dedicated Professionals (PDPs) based in the APAC;Follow an agreed schedule and cover set topics in each communication.\n\n  Collaborate with the CoE team, Account Managers, and other internal stakeholders to accurately assess gaps and/or needs identified through outreach to PDPs.\n  Partner with the CoE team, Specialized Divisions, and Shared Services to design and implement remedial action and proactive initiatives.\n  Document details of their engagement with each PDP for the purpose of data analysis and identification of best practices.\n  Respond to communication initiated by PDPs and follow-up on their questions in a timely manner.\n  Other duties, as assigned.\n\nEducation, Experience, and Certifications:\nBachelor's degree with two to three years of client and/or service-oriented work experience. Pinkerton is inclusive employer who seeks with diverse background, experience, and perspectives.\n \nCompetencies:\n\n  Demonstrable interest in people matters including; wellbeing, professional development, training, and team-building.\n  Strong problem resolution skills.\n  Strong client orientation.\n  Attentive to detail, accuracy, and record-keeping.\n  Able to manage multiple projects simultaneously with competing priorities and deadlines.\n  Able to multi-task and organize workload for effective implementation.\n  Effective written and verbal communication skills.\n  Able to interact effectively at all levels and across diverse cultures.\n  Understands the importance of diversity and inclusion by embedding thoughtful communication within every interaction and engagement.\n\nWorking Conditions:\nWith or without reasonable accommodation, requires the physical and mental capacity to effectively perform all essential functions;\n\n  Exposure to sensitive and confidential information.\n  Regular computer usage.\n  Occasional reaching and lifting of small objects and operating office equipment.\n  Ability to adjust focus between close and distance vision.\n  Frequent sitting.\n  Remote work environment.\n"
  },
  {
    "jobTitle": "Senior Backend Developer (Remote)",
    "companyName": "RANDSTAD PTE. LIMITED",
    "salaryRange": "$7,000 $9,000",
    "jobCategory": "Information Technology",
    "jobLevel": "Senior Executive",
    "employmentType": "Permanent",
    "postedDate": "03 Feb 2023",
    "expiryDate": "05 Mar 2023",
    "minimumExperience": "3 years exp",
    "jobDescription": "About the company\nWe're a global cybersecurity company that empowers fast-growing companies to streamline their secure software development processes.Due to the expansion plans, we are looking to hire multiple backend developers within the team.\n\nAbout the job\n\n  You will continuously contribute to our platform to ensure that our backend services are fast, reliable and scalable.\n  Developing ambitious features and functionality in line with our product roadmap.\n  You are opinionated about how Internet scale backends are engineered and happy to have constructive conversations with the team on how to continuously improve our platform.\n\nAbout the manager/team\nYou will work together with product managers, designers, and frontend and backend engineers towards aligned goals.\n\nSkills and experience required\nYou will need to have min diploma/degree in computer science or related fields. Other requirements are as follow:\n\n  Excellent NodeJS (TypeScript) coding skills\n  Able to write maintainable, well tested, secure and performant code\n  Have a good understanding of the different database types (NoSQL, SQL, Key-Value, ...) and are able to write maintainable and optimized queries\n\nInterested candidates please send your updated CV to steve.ling@randstad.com.g and we could have a quick chat to discuss it further.\n(EA: 94C3609/ R1332781)"
  },
  {
    "jobTitle": "Remote Control Center (RCC) Operations Manager",
    "companyName": "OCEAN INFINITY PTE. LTD.",
    "salaryRange": "$15,000 $15,001",
    "jobCategory": "General Management",
    "jobLevel": "Manager",
    "employmentType": "Permanent",
    "postedDate": "08 Feb 2023",
    "expiryDate": "10 Mar 2023",
    "minimumExperience": "5 years exp",
    "jobDescription": "We are a technology company transforming operations at sea to enable people and the planet to thrive.\n\nWe are open-minded and fearless in our approach to innovation and don't believe in boundaries. We challenge everything and have massive ambitions to drag aging industries into the tech era.\n\nWe take safety, equality, and education very seriously, and our responsibilities don't stop at our front door. Our business is built on the belief that there's definitely a more environmentally responsible way to operate at sea.\n\nWe only employ the best people. People with a desire for excellence, a curious nature, thoughtful, humble, collaborative, and accountable.\n\nWe reward our people well. Beyond what's usually considered to be the 'market average'.\n\nThe opportunities for people in our business can be limitless, spanning many disciplines and open to all, regardless of background and experience level.\n\nRemote Control Center (RCC) Operations Manager is an experienced person from marine operations who is open-minded and who embraces new technology and new ways of working. The person will be leading an industry-changing transition from sea to shore and will be responsible for building a strong team in the Remote Control Center in close collaboration with the Fleet Management team and the payload operations team.\n\nJob Description:\n\n\n  Build and implement robust RCC procedures and routines that facilitate the transition from operations at sea to shore;\n  Constantly strive for improvements and more efficient ways of working;\n  Plan and execute cross-training of personnel;\n  Identify and build new roles to satisfy the new operational needs of the company;\n  Build and plan for in-house manning capacity with a view to reducing the use of manning agencies to a minimum;\n  Ensure the RCC operations are well planned and conducted safely and with sufficient redundancy in terms of personnel availability and skillset;\n  Build a truly global operational RCC capability;\n  Work closely with flag states, unions, and other stakeholders to drive the legislation and perception of the RCC operations in a desired way.\n\nQualifications:\n\n\n  Operational marine experience in a senior role;\n  Experience in building training programs;\n  Experience in change management;\n  Strong understanding of quality management such as standards, regulations, and applicable policies and procedures;\n  Good practical experience with office tools: MS Office, Sharepoint, Teams, and e-mail, among others\n  Interested in others and strives for the best for the team; Ability to take ownership and engagement in the work;\n  Integrity, credibility, and maturity for confidential issues;\n  Ability to work as a trusted advisor with senior stakeholders;\n  Excellent time management skills and ability to prioritize work in a fast-paced environment;\n  Strong leadership skills;\n  Strong interpersonal and people management skills;\n  Strong communication skills;\n  Driven, proactive, and able to work autonomously with little supervision toward the company's purpose;\n  Critical thinking and ability to show initiative;\n  Open and receptive to new and different ideas;\n  Ability to work well in a team and independently;\n  Enthusiastic about protecting people and the planet\n\nIf interested, please submit your CV to : careers@oceaninfinity.com \n\n"
  },
  {
    "jobTitle": "Finance Mgr, Asst Mgr for Scaling Tech Startup (Fully Remote)",
    "companyName": "HUMAN CAPITAL ALPHA PTE. LTD.",
    "salaryRange": "$5,000 $7,000",
    "jobCategory": "Accounting / Auditing / Taxation",
    "jobLevel": "Manager",
    "employmentType": "Permanent",
    "postedDate": "07 Feb 2023",
    "expiryDate": "09 Mar 2023",
    "minimumExperience": "4 years exp",
    "jobDescription": "Finance Mgr, Asst Mgr for Scaling Tech Startup (Fully Remote)\n\nThis is an exciting opportunity for an entrepreneurial candidate to join a scaling tech startup with a strong mandate to grow within the region.\n\nReporting directly to the Company's partners, you will manage financial oversight of the company and play a key role in leading financial decision-making.\n\nResponsibilities\n\n  Financial Reporting & Analysis (including reelvant forecasting and modelling)\n  Oversee bugeting and forecasting cycle in line with management reporting requirements\n  Handle financial operations      including claims and payments\n\n‍Qualifications\n\n  4-6 years of accounting and finance experience\n  Degree in Accounting, Finance, or related field.\n  ACCA fully qualified/CPA part or fully qualified preferably.\n  Familiarity with local financial reporting standards\n  Excellent verbal and written      communications skills\n\n\nEA License No. 15C7420\nEA Reg No: R1218187\n\nDate ad posted: 2023-02-07\n"
  },
  {
    "jobTitle": "Accounts & HR Executive (Remote)",
    "companyName": "PRELUDIO PRIVATE LIMITED",
    "salaryRange": "$1,200 $1,500",
    "jobCategory": "Accounting / Auditing / Taxation, Admin / Secretarial, General Management, Human Resources, Insurance",
    "jobLevel": "Executive",
    "employmentType": "Contract, Part Time, Freelance, Flexi-work",
    "postedDate": "20 Jan 2023",
    "expiryDate": "19 Feb 2023",
    "minimumExperience": "3 years exp",
    "jobDescription": "Overview\nCome work at Preludio, a contemporary fine dining concept located in an exclusive tranquil oasis in the CBD. We are looking to hire a part-time Accounts & HR Executive to manage our restaurant's administrative duties. You will be working directly with the directors of the company.\nAccounting\n\n  Bookkeeping in MYOB accounting system, monthly (up to 150 bank transactions per month)\n  Audits & tax return filings (GST and VAT), annually\n  Establishing and reconciling all operating bank accounts\n  Prepare financial reports, forecasting, budgeting and statutory reports, monthly:Profit & Loss Statement\nVariance comparison of Budget vs Actual\nCash Flow Statement\nBudget Report update\nBalance Sheet (generate from MYOB)\nTrade Creditors Listing (generate from MYOB)\n\n  Manage timely closing process and reconciliations, monthly:GTO submission to landlord\nGIRO payments (CPG, FWL, GST, etc...)\nCPF submission\nSales entry\n\n  GST submission, quarterly (next filing: Jan 2022)\n  Prepare and review budget, revenue, expense, payroll entries, invoices, and other accounting documents\n  Resolve accounting discrepancies\n  Oversee, review & implement an effective system of internal control procedures and reporting\n  Interact with internal and external auditors in completing audits\n  Search for government grants applicable to SME\n  Perform ad-hoc duties such as client invoicing, payments, refunds, etc...\n  Attend management meetings with directors via video call, monthly\n\nHuman Resources\n\n  Payroll for 15-20 employees and payslip generation\n  CPF submission, monthly\n  Recruiting: posting of jobs on portals, forwarding resumes to hiring manager, preparation of employee contracts\n  Work Pass: applications, renewals and cancellations\n  Employee records: update and maintenance\n  Leave: administration and tracking\n  Insurance: update coverage for employees\n  General administrative support: company letters, memo issuance, etc...\n  Performance management review\n\nJob Requirements\n\n  Excellent level of proficiency in English\n  A diploma or degree in accountancy, finance or economics\n  The ability to manage multiple tasks and priorities successfully\n  Experience in working in highly collaborative, fast-paced environments\n  Basic knowledge of Human Resources\n"
  },
  {
    "jobTitle": "Customer Success Engineer (Remote work, CCNA, / Satcom / Telecomm)",
    "companyName": "OAKTREE CONSULTING",
    "salaryRange": "$5,000 $6,500",
    "jobCategory": "Engineering, Telecommunications",
    "jobLevel": "Executive",
    "employmentType": "Permanent, Full Time",
    "postedDate": "25 Jan 2023",
    "expiryDate": "24 Feb 2023",
    "minimumExperience": "3 years exp",
    "jobDescription": "Job Duties:\n\n• Ensuring TAC tickets and resolve customer technical complaints within stipulated TTR (Time to Resolve) SLA\n• Update/handle tickets in ticketing system as per TAC handbook, respond to incoming emails, calls, and web requests from customer in a timely manner\n• Execute and lead service interventions such as system upgrades, configuration changes and preventive maintenances\n• Replicate customer problems in lab, escalate issues to engineering when engineering help is required either in debugging or problem has been reproduced in the lab\n• Perform on-site or TAC-Remote network audit for customers\n• Serve Premium or Strategic customer as a Technical Account Manager (TAM)\n• Assist the team with escalations as and when required\n• Assist customers in planned major network maintenances\n• Participate in rotating shift duties to support 7x24x365 operations\n• Deliver basic and advance training to iDirect customers\n• Maintain and upgrade the training lab to the latest software release as and when required\n• Provide feedback to the content developer on training material for continuous improvement\n• Work with internal and external customers to make sure all requirements are met\n• Able to travel in short notice when needed\n\n\nJob Requirements:\n• Minimum bachelor’s degree in Electrical/ Electronics/Telecommunications Engineering\n• Minimum of 3-5 years working experience in SATCOM industry\n• Working knowledge or practical experience with\n· IP-based networks with a CCNA certification or above\n· SATCOM knowledge and experience\n· Knowledge with programming language or scripting experience (added advantage)\n• Problem solving skills, analytical skills, and the ability to make decisions quickly\n• Meticulous and process orientated\n• Excellent customer service skills\n• Position based in Singapore/remotely\n\n\n\nPlease submit resumes to john@oaktree.com.sg with the following details in MS Word format:\n\n- Position applying for\n- Current remuneration\n- Expected remuneration\n- Notice period\n\n\nJohn Goh Meng Chye\nEA License No : 06C4642\nEA Reg No : R1102621\n\n\nWe regret that only shortlisted candidates will be notified."
  },
  {
    "jobTitle": "Customer Success Engineer (Remote work, CCNA, / Satcom / Telecomm)",
    "companyName": "OAKTREE CONSULTING",
    "salaryRange": "$5,000 $6,500",
    "jobCategory": "Engineering, Telecommunications",
    "jobLevel": "Executive",
    "employmentType": "Permanent, Full Time",
    "postedDate": "01 Feb 2023",
    "expiryDate": "03 Mar 2023",
    "minimumExperience": "3 years exp",
    "jobDescription": "Job Duties:\n\n• Ensuring TAC tickets and resolve customer technical complaints within stipulated TTR (Time to Resolve) SLA\n• Update/handle tickets in ticketing system as per TAC handbook, respond to incoming emails, calls, and web requests from customer in a timely manner\n• Execute and lead service interventions such as system upgrades, configuration changes and preventive maintenances\n• Replicate customer problems in lab, escalate issues to engineering when engineering help is required either in debugging or problem has been reproduced in the lab\n• Perform on-site or TAC-Remote network audit for customers\n• Serve Premium or Strategic customer as a Technical Account Manager (TAM)\n• Assist the team with escalations as and when required\n• Assist customers in planned major network maintenances\n• Participate in rotating shift duties to support 7x24x365 operations\n• Deliver basic and advance training to iDirect customers\n• Maintain and upgrade the training lab to the latest software release as and when required\n• Provide feedback to the content developer on training material for continuous improvement\n• Work with internal and external customers to make sure all requirements are met\n• Able to travel in short notice when needed\n\n\nJob Requirements:\n• Minimum bachelor’s degree in Electrical/ Electronics/Telecommunications Engineering\n• Minimum of 3-5 years working experience in SATCOM industry\n• Working knowledge or practical experience with\n· IP-based networks with a CCNA certification or above\n· SATCOM knowledge and experience\n· Knowledge with programming language or scripting experience (added advantage)\n• Problem solving skills, analytical skills, and the ability to make decisions quickly\n• Meticulous and process orientated\n• Excellent customer service skills\n• Position based in Singapore/remotely\n\n\n\nPlease submit resumes to john@oaktree.com.sg with the following details in MS Word format:\n\n- Position applying for\n- Current remuneration\n- Expected remuneration\n- Notice period\n\n\nJohn Goh Meng Chye\nEA License No : 06C4642\nEA Reg No : R1102621\n\n\nWe regret that only shortlisted candidates will be notified."
  },
  {
    "jobTitle": "Customer Success Engineer (Remote work, CCNA, / Satcom / Telecomm)",
    "companyName": "OAKTREE CONSULTING",
    "salaryRange": "$5,000 $6,500",
    "jobCategory": "Engineering, Telecommunications",
    "jobLevel": "Executive",
    "employmentType": "Permanent, Full Time",
    "postedDate": "01 Feb 2023",
    "expiryDate": "03 Mar 2023",
    "minimumExperience": "3 years exp",
    "jobDescription": "Job Duties:\n\n• Ensuring TAC tickets and resolve customer technical complaints within stipulated TTR (Time to Resolve) SLA\n• Update/handle tickets in ticketing system as per TAC handbook, respond to incoming emails, calls, and web requests from customer in a timely manner\n• Execute and lead service interventions such as system upgrades, configuration changes and preventive maintenances\n• Replicate customer problems in lab, escalate issues to engineering when engineering help is required either in debugging or problem has been reproduced in the lab\n• Perform on-site or TAC-Remote network audit for customers\n• Serve Premium or Strategic customer as a Technical Account Manager (TAM)\n• Assist the team with escalations as and when required\n• Assist customers in planned major network maintenances\n• Participate in rotating shift duties to support 7x24x365 operations\n• Deliver basic and advance training to iDirect customers\n• Maintain and upgrade the training lab to the latest software release as and when required\n• Provide feedback to the content developer on training material for continuous improvement\n• Work with internal and external customers to make sure all requirements are met\n• Able to travel in short notice when needed\n\n\nJob Requirements:\n• Minimum bachelor’s degree in Electrical/ Electronics/Telecommunications Engineering\n• Minimum of 3-5 years working experience in SATCOM industry\n• Working knowledge or practical experience with\n· IP-based networks with a CCNA certification or above\n· SATCOM knowledge and experience\n· Knowledge with programming language or scripting experience (added advantage)\n• Problem solving skills, analytical skills, and the ability to make decisions quickly\n• Meticulous and process orientated\n• Excellent customer service skills\n• Position based in Singapore/remotely\n\n\n\nPlease submit resumes to john@oaktree.com.sg with the following details in MS Word format:\n\n- Position applying for\n- Current remuneration\n- Expected remuneration\n- Notice period\n\n\nJohn Goh Meng Chye\nEA License No : 06C4642\nEA Reg No : R1102621\n\n\nWe regret that only shortlisted candidates will be notified."
  },
  {
    "jobTitle": "Software Engineer (Remote)",
    "companyName": "R VANTAGE PTE. LTD.",
    "salaryRange": "$4,000 $8,000",
    "jobCategory": "Engineering",
    "jobLevel": "Manager",
    "employmentType": "Permanent, Full Time",
    "postedDate": "01 Feb 2023",
    "expiryDate": "03 Mar 2023",
    "minimumExperience": "3 years exp",
    "jobDescription": "Roles and Responsibilities:\n\n  Develop, Document and maintain new API endpoints and front-end features.\n  Produce high quality complex deliverables with minimal input and supervision\n  Participate in the development process from definition to deployment.\n  Build internal tooling to improve development efficiency\n  Write review and maintain code using relevant design patterns on a full software stack.\n  Translate designs and wireframes into high quality full stack code (React, Ruby).\n  Design overall architecture of the web/backend/mobile application.\n  Perform code reviews for team deliverables to ensure code follows documented standards and best practices.\n  Help evolve systems architecture to consistently improve development efficiency.\n  Work with product owners and end-users to clarify specifications and get feedback.\n  Collaborate with other engineers and designers to develop and ship features.\n"
  },
  {
    "jobTitle": "IT Engineer - Remote Support (BANK)**Training Provided",
    "companyName": "SMART FORTE CONSULTING LLP",
    "salaryRange": "$2,500 $3,000",
    "jobCategory": "Information Technology",
    "jobLevel": "Fresh/entry level",
    "employmentType": "Full Time",
    "postedDate": "01 Feb 2023",
    "expiryDate": "03 Mar 2023",
    "minimumExperience": "",
    "jobDescription": "\n  First point of contact regards to any IT issues face by bank users\n  Provide solutions to simple issues reported by bank users over remote assist by phone or network remote control. Escalate complicated issues to the next level.\n  Provide remote technical assistance and support related to computer systems, hardware, or software.\n  Responds to queries, runs diagnostic programs, isolates problems, determines and implements solution.\n  Applies understanding and knowledge of information systems products and services to assist users.\n  Identify and investigate user questions and problems as well as isolating and resolving information system problems.\n  Prioritizes issues using appropriate escalation procedures, and coordinates referrals to technical, professional, or service personnel as needed.\n  Evaluating alternative approaches and selecting optimal approaches.\n  Focus on SLA and resolution process.\n\nJob Requirements\n\n  Diploma / Nitec in Information Technology, Computer Engineering or relevant\n  Welcome entry level - Training Provided\n  Bank work environment at Raffles Place\n  $2500 - $3000\n  Start work immediately or within short notice\n\nInterested applicants please submit your resume. Shortlisted candidates will be contacted very soon. Thank you."
  },
  {
    "jobTitle": "Team Lead (Hybrid / Remote)",
    "companyName": "BCD TRAVEL SINGAPORE PTE. LTD.",
    "salaryRange": "$5,500 $6,000",
    "jobCategory": "Travel / Tourism",
    "jobLevel": "Senior Executive",
    "employmentType": "Full Time",
    "postedDate": "26 Jan 2023",
    "expiryDate": "25 Feb 2023",
    "minimumExperience": "3 years exp",
    "jobDescription": "Bring your passion and energy to our growing team. We’re hiring!\n\nTeam Lead (Hybrid/Remote)\nFull time, Singapore\n\nAs a Team Lead, you are responsible for day-to-day management of a travel consultant team, including managing key performance indicators (KPI), workload, providing assistance and coaching. He/She is also responsible for accurately and efficiently handling incoming requests via multiple channels (i.e. phone, email, etc.) and handling additional duties as assigned.\n\nThe travel consultant is this primary point of contact for the customer and provides active travel consultation towards the business customers, including providing travel details and up-selling of related product.\n\nThis position demonstrates an extensive understanding and applicability of all areas in the travel industry. Works independently on requests as assigned and takes the initiative to provide assistance.\n\n1. Handle Incoming Requests:\n\n  Expertly use the appropriate the BCD Travel tools and systems to complete requests which include search and confirm travel reservations for the traveler\n  Strong understanding of a client travel policy and can appropriately guide and consistently provide consultation to the customer\n  Provide travel offers and general travel advice to travelers\n  Responds to requests accurately and completely\n  Excellent knowledge and application of travel supplier rules\n  Maintains, actively communicates and seeks expansion of current knowledge of the state of the various travel industries supported\n  Provides the customer with the required industry information, such as low fares, exchange costs and penalties\n  Fulfill all requests regarding necessary regulations (DOT, TSA, passports, visas, etc.)\n  Supports BCD Travel and client driven initiatives\n\n\n2. Problem Solving:\n\n  Appropriately responds and resolves customers inquiries\n  Anticipates and provides assistance on potential challenges that may arise for the customer\n  Performs follow-up as needed and within the time frame promised to the customer\n  Proactively provides feedback to management to avoid future customer issues\n  Accurately logs the complaint in the BCD Travel systems\n  Appropriately displays empathy and acknowledging statements to diffuse emotion during adversity\n  Responds and follows through on customer inquiries and complaints received directly or from management (Account or Operational)\n  Anticipate potential issues and work to proactively resolve them\n  Review team issues, determine root causes, alternative solutions and provide feedback to the individual and the team\n\n3. Quality:\n\n  Consistently exceeds individual goals\n  Monitors, sorts and works global distribution systems (GDS) queues daily to maintain quality control\n  Effectively uses the telephone systems\n  Completes reservations with a few errors\n  Consistently follows BCD Travel call/email guidelines\n  Research errors to determine the root cause, recommends and executes solutions \n  Monitors and provides feedback on errors made by the team\n\n4. Service Excellence:\n\n  Responds to the customer promptly\n  Always provides the customer his/her undivided attention to the request\n  Always listens, does not ask the customer to repeat information he/she already provided and applies the information to the inquiry\n  Responds appropriately and asks questions targeted to encourage complete responses\n  Creates rapport with the customer, by showing interest, having a friendly tone of voice, using the customer's name appropriately and making the most of small talk\n  Matches the customer's tone and pace as appropriate\n  Keeps the interaction moving forward\n  Offers suggestions to the customer and anticipates needs\n  Is mindful of the client service level agreement in all transactions\n\n5. Teamwork:\n\n  Seeks opportunities to review operational processes and the commercial relationship with customer and provides suggestions for improvement\n  Volunteers for additional administrative tasks\n  Always searches for opportunities to move market share to BCD Travel preferred suppliers\n  Seeks opportunities to helps team members\n  Provides a team of travel consultants feedback, including responding to questions, providing direction and feedback\n  Ensures team members are kept up to date with new polices, procedures and announcements\n  Oversees and assists the team members in balancing priorities and managing their workload so team KPIs are consistently achieved\n  Works with performance data to maximum the effectiveness and efficiency of the team\n  Creates a positive work environment\n\n6. Communication:\n\n  Uses positive language and word choices to avoid negative customer reactions\n  Avoids jargon or clichés\n  Matches the customer's tone and pace\n  Applies proper communication guidelines (clear, concise and personal) to interactions\n  Uses correct grammar in interactions\n\n7. General Management Responsibilities:\n\n  Manages all key performance metrics evaluating or implementing and reviewing measurements, coaching and continuous improvement\n  Responsible for all assigned administrative tasks\n  Leads change efforts, providing information and communication\n  Delegates work to others for improved results and individual growth as applicable\n\n8. Administrative Tasks:\n\n  Performs quality management such as error management\n  Completes administrative tasks as assigned\n  Assists or oversees testing or researching root causes and develops suggestions for improvement\n  Assists in projects as assigned (ex: implementations)\n  Attend scheduled meetings or calls as assigned\n  Conducts meetings and training sessions as appropriate\n  Aids in Disaster Recovery plans and efforts\n  Manages day-to-day needs of the team and provides assistance and direction\n\n9. Other:\n\n  This job description is not designed to contain a comprehensive listing of activities, duties or responsibilities that are required for this position.  The employee may be asked to perform other duties and responsibilities, as necessary.\n\nAbout you\nEssential:\n· Bachelor degree, or equivalent work experience\n· Minimum of 3-5 plus years experience in the corporate travel management industry\n· Solid working knowledge of the travel industry, policies, procedures and processes\n· Advanced skills on travel industry systems (i.e. GDS)\n· Strong verbal and written communication skills in designated languages\n· Proven ability to handle multiple priorities  simultaneously\n· Ability to work flexible hours\n· Ability to work independently, exercising discretion and judgment\n· Demonstrated excellent professional customer service and problem resolution skills\n· Strong problem solving and/or critical thinking skills\nPreferred:\n· Proficiency in Microsoft Office applications\n· Demonstrated internet research skills for customer information\n· Degree in tourism-related field\n\nAbout us\n We’re a market leader in travel management: We help people and companies travel smart and achieve more, and our clients include some of the world’s best-known and most innovative business and consumer brands. We operate in more than 100 countries, and the majority of our 10,000+ people work virtually (because a 10-second commute usually makes awesome sense). We’re committed to sustainability and to driving success for our customers, our business and ourselves. Learn more about BCD Travel.\n\nYour life at BCD\nWorking at BCD means connecting, collaborating and celebrating. You’ll be part of a virtual, dynamic and flexible work environment that fosters a good work-life balance so you can focus on what makes you happy. But don’t just take our word for it! Hear why people join BCD and more about the great perks of Life at BCD.\nYou’ll be offered\n\n  Flexible working hours and work-from-home or remote opportunities\n  Opportunities to grow your skillset and career\n  Generous vacation days so you can rest and recharge\n  A compensation package that feels fair to you, including mental, physical, and financial wellbeing tools\n  Travel industry professional perks and discounts\n  An inclusive work environment where diversity is celebrated\n\nReady to join the journey? Apply now!\nWe’re dedicated to building a diverse, inclusive and authentic workplace. If you’re excited about a role, but your experience doesn’t align perfectly, we encourage you to apply. You may be just the right candidate for this or other positions."
  },
  {
    "jobTitle": "Customer Success Engineer (Remote work, CCNA, / Satcom / Telecomm)",
    "companyName": "OAKTREE CONSULTING",
    "salaryRange": "$5,000 $6,500",
    "jobCategory": "Engineering, Telecommunications",
    "jobLevel": "Executive",
    "employmentType": "Permanent, Full Time",
    "postedDate": "07 Feb 2023",
    "expiryDate": "09 Mar 2023",
    "minimumExperience": "3 years exp",
    "jobDescription": "Job Duties:\n\n• Ensuring TAC tickets and resolve customer technical complaints within stipulated TTR (Time to Resolve) SLA\n• Update/handle tickets in ticketing system as per TAC handbook, respond to incoming emails, calls, and web requests from customer in a timely manner\n• Execute and lead service interventions such as system upgrades, configuration changes and preventive maintenances\n• Replicate customer problems in lab, escalate issues to engineering when engineering help is required either in debugging or problem has been reproduced in the lab\n• Perform on-site or TAC-Remote network audit for customers\n• Serve Premium or Strategic customer as a Technical Account Manager (TAM)\n• Assist the team with escalations as and when required\n• Assist customers in planned major network maintenances\n• Participate in rotating shift duties to support 7x24x365 operations\n• Deliver basic and advance training to iDirect customers\n• Maintain and upgrade the training lab to the latest software release as and when required\n• Provide feedback to the content developer on training material for continuous improvement\n• Work with internal and external customers to make sure all requirements are met\n• Able to travel in short notice when needed\n\n\nJob Requirements:\n• Minimum bachelor’s degree in Electrical/ Electronics/Telecommunications Engineering\n• Minimum of 3-5 years working experience in SATCOM industry\n• Working knowledge or practical experience with\n· IP-based networks with a CCNA certification or above\n· SATCOM knowledge and experience\n· Knowledge with programming language or scripting experience (added advantage)\n• Problem solving skills, analytical skills, and the ability to make decisions quickly\n• Meticulous and process orientated\n• Excellent customer service skills\n• Position based in Singapore/remotely\n\n\n\nPlease submit resumes to john@oaktree.com.sg with the following details in MS Word format:\n\n- Position applying for\n- Current remuneration\n- Expected remuneration\n- Notice period\n\n\nJohn Goh Meng Chye\nEA License No : 06C4642\nEA Reg No : R1102621\n\n\nWe regret that only shortlisted candidates will be notified."
  }
]
